%опорные точки
xi1 = [2 0 0 0 1.3090 3.1416];
xi2 = [2 0 2 0 0.5236 3.1416];
xi3 = [0 2 2 1.5708 0.5236 3.1416];
xi4 = [0 2 0 1.5708 1.3090 3.1416];

%начальная и конечная скорости и ускорения
dq1 = [0 0 0 0 0 0];
ddq1 = [0 0 0 0 0 0];

dq4 = [0 0 0 0 0 0];
ddq4 = [0 0 0 0 0 0];

%отрезки времени
t1 = 0; t2 = 2; t3 = 4; t4 = 6;

inc = 600; %детализация траектории

q1 = ik(xi1);
q2 = ik(xi2);
q3 = ik(xi3);
q4 = ik(xi4);

M = [0 0 0 0 1 0 0 0 0 0 0 0 0 0;...
     0 0 0 1 0 0 0 0 0 0 0 0 0 0;...
     0 0 2 0 0 0 0 0 0 0 0 0 0 0;...
     1 1 1 1 1 0 0 0 0 0 0 0 0 0;...
     0 0 0 0 0 0 0 0 1 0 0 0 0 0;...
     4 3 2 1 0 0 0 -1 0 0 0 0 0 0;...
     12 6 2 0 0 0 -2 0 0 0 0 0 0 0;...
     0 0 0 0 0 1 1 1 1 0 0 0 0 0;...
     0 0 0 0 0 0 0 0 0 0 0 0 0 1;...
     0 0 0 0 0 3 2 1 0 0 0 0 -1 0;...
     0 0 0 0 0 6 2 0 0 0 0 -2 0 0;...
     0 0 0 0 0 0 0 0 0 1 1 1 1 1;...
     0 0 0 0 0 0 0 0 0 4 3 2 1 0;...
     0 0 0 0 0 0 0 0 0 12 6 2 0 0];
 
k1 = inv(M)*[q1(1) dq1(1) ddq1(1) q2(1) q2(1) 0 0 q3(1) q3(1) 0 0 q4(1) dq4(1) ddq4(1)]';
k2 = inv(M)*[q1(2) dq1(2) ddq1(2) q2(2) q2(2) 0 0 q3(2) q3(2) 0 0 q4(2) dq4(2) ddq4(2)]';
k3 = inv(M)*[q1(3) dq1(3) ddq1(3) q2(3) q2(3) 0 0 q3(3) q3(3) 0 0 q4(3) dq4(3) ddq4(3)]';
k4 = inv(M)*[q1(4) dq1(4) ddq1(4) q2(4) q2(4) 0 0 q3(4) q3(4) 0 0 q4(4) dq4(4) ddq4(4)]';
k5 = inv(M)*[q1(5) dq1(5) ddq1(5) q2(5) q2(5) 0 0 q3(5) q3(5) 0 0 q4(5) dq4(5) ddq4(5)]';
k6 = inv(M)*[q1(6) dq1(6) ddq1(6) q2(6) q2(6) 0 0 q3(6) q3(6) 0 0 q4(6) dq4(6) ddq4(6)]';

q = zeros(6, inc);
dq = zeros(6, inc);
ddq = zeros(6, inc);
i = 1;
for t=linspace(t1,t4,inc)
    tau1 = (t-t1)/(t2-t1);
    tau2 = (t-t2)/(t3-t2);
    tau3 = (t-t3)/(t4-t3);
    if (t >= t1) && (t < t2)
        q(1, i) = k1(1)*tau1^4 + k1(2)*tau1^3 + k1(3)*tau1^2 + k1(4)*tau1+k1(5); 
        q(2, i) = k2(1)*tau1^4 + k2(2)*tau1^3 + k2(3)*tau1^2 + k2(4)*tau1+k2(5); 
        q(3, i) = k3(1)*tau1^4 + k3(2)*tau1^3 + k3(3)*tau1^2 + k3(4)*tau1+k3(5); 
        q(4, i) = k4(1)*tau1^4 + k4(2)*tau1^3 + k4(3)*tau1^2 + k4(4)*tau1+k4(5); 
        q(5, i) = k5(1)*tau1^4 + k5(2)*tau1^3 + k5(3)*tau1^2 + k5(4)*tau1+k5(5); 
        q(6, i) = k6(1)*tau1^4 + k6(2)*tau1^3 + k6(3)*tau1^2 + k6(4)*tau1+k6(5);
        dq(1, i) = 4*k1(1)*tau1^3 + 3*k1(2)*tau1^2 + 2*k1(3)*tau1 + k1(4);
        dq(2, i) = 4*k2(1)*tau1^3 + 3*k2(2)*tau1^2 + 2*k2(3)*tau1 + k2(4);
        dq(3, i) = 4*k3(1)*tau1^3 + 3*k3(2)*tau1^2 + 2*k3(3)*tau1 + k3(4);
        dq(4, i) = 4*k4(1)*tau1^3 + 3*k4(2)*tau1^2 + 2*k4(3)*tau1 + k4(4);
        dq(5, i) = 4*k5(1)*tau1^3 + 3*k5(2)*tau1^2 + 2*k5(3)*tau1 + k5(4);
        dq(6, i) = 4*k6(1)*tau1^3 + 3*k6(2)*tau1^2 + 2*k6(3)*tau1 + k6(4);
        ddq(1,i) = 12*k1(1)*tau1^2 + 6*k1(2)*tau1 + 2*k1(3);
        ddq(2,i) = 12*k2(1)*tau1^2 + 6*k2(2)*tau1 + 2*k2(3);
        ddq(3,i) = 12*k3(1)*tau1^2 + 6*k3(2)*tau1 + 2*k3(3);
        ddq(4,i) = 12*k4(1)*tau1^2 + 6*k4(2)*tau1 + 2*k4(3);
        ddq(5,i) = 12*k5(1)*tau1^2 + 6*k5(2)*tau1 + 2*k5(3);
        ddq(6,i) = 12*k6(1)*tau1^2 + 6*k6(2)*tau1 + 2*k6(3);
    elseif (t >= t2) && (t < t3)
        q(1, i) = k1(6)*tau2^3 + k1(7)*tau2^2 + k1(8)*tau2+k1(9);
        q(2, i) = k2(6)*tau2^3 + k2(7)*tau2^2 + k2(8)*tau2+k2(9);
        q(3, i) = k3(6)*tau2^3 + k3(7)*tau2^2 + k3(8)*tau2+k3(9);
        q(4, i) = k4(6)*tau2^3 + k4(7)*tau2^2 + k4(8)*tau2+k4(9);
        q(5, i) = k5(6)*tau2^3 + k5(7)*tau2^2 + k5(8)*tau2+k5(9);
        q(6, i) = k6(6)*tau2^3 + k6(7)*tau2^2 + k6(8)*tau2+k6(9);
        dq(1, i) = 3*k1(6)*tau2^2 + 2*k1(7)*tau2 + k1(8);
        dq(2, i) = 3*k2(6)*tau2^2 + 2*k2(7)*tau2 + k2(8);
        dq(3, i) = 3*k3(6)*tau2^2 + 2*k3(7)*tau2 + k3(8);
        dq(4, i) = 3*k4(6)*tau2^2 + 2*k4(7)*tau2 + k4(8);
        dq(5, i) = 3*k5(6)*tau2^2 + 2*k5(7)*tau2 + k5(8);
        dq(6, i) = 3*k6(6)*tau2^2 + 2*k6(7)*tau2 + k6(8);
        ddq(1,i) = 6*k1(6)*tau2 + 2*k1(7);
        ddq(2,i) = 6*k2(6)*tau2 + 2*k2(7);
        ddq(3,i) = 6*k3(6)*tau2 + 2*k3(7);
        ddq(4,i) = 6*k4(6)*tau2 + 2*k4(7);
        ddq(5,i) = 6*k5(6)*tau2 + 2*k5(7);
        ddq(6,i) = 6*k6(6)*tau2 + 2*k6(7);
    elseif (t >= t3) && (t <= t4)
        q(1, i) = k1(10)*tau3^4 + k1(11)*tau3^3 + k1(12)*tau3^2 + k1(13)*tau3 + k1(14); 
        q(2, i) = k2(10)*tau3^4 + k2(11)*tau3^3 + k2(12)*tau3^2 + k2(13)*tau3 + k2(14); 
        q(3, i) = k3(10)*tau3^4 + k3(11)*tau3^3 + k3(12)*tau3^2 + k3(13)*tau3 + k3(14); 
        q(4, i) = k4(10)*tau3^4 + k4(11)*tau3^3 + k4(12)*tau3^2 + k4(13)*tau3 + k4(14); 
        q(5, i) = k5(10)*tau3^4 + k5(11)*tau3^3 + k5(12)*tau3^2 + k5(13)*tau3 + k5(14); 
        q(6, i) = k6(10)*tau3^4 + k6(11)*tau3^3 + k6(12)*tau3^2 + k6(13)*tau3 + k6(14);
        dq(1, i) = 4*k1(10)*tau3^3 + 3*k1(11)*tau3^2 + 2*k1(12)*tau3 + k1(13);
        dq(2, i) = 4*k2(10)*tau3^3 + 3*k2(11)*tau3^2 + 2*k2(12)*tau3 + k2(13);
        dq(3, i) = 4*k3(10)*tau3^3 + 3*k3(11)*tau3^2 + 2*k3(12)*tau3 + k3(13);
        dq(4, i) = 4*k4(10)*tau3^3 + 3*k4(11)*tau3^2 + 2*k4(12)*tau3 + k4(13);
        dq(5, i) = 4*k5(10)*tau3^3 + 3*k5(11)*tau3^2 + 2*k5(12)*tau3 + k5(13);
        dq(6, i) = 4*k6(10)*tau3^3 + 3*k6(11)*tau3^2 + 2*k6(12)*tau3 + k6(13);
        ddq(1,i) = 12*k1(10)*tau3^2 + 6*k1(11)*tau3 + 2*k1(12);
        ddq(2,i) = 12*k2(10)*tau3^2 + 6*k2(11)*tau3 + 2*k2(12);
        ddq(3,i) = 12*k3(10)*tau3^2 + 6*k3(11)*tau3 + 2*k3(12);
        ddq(4,i) = 12*k4(10)*tau3^2 + 6*k4(11)*tau3 + 2*k4(12);
        ddq(5,i) = 12*k5(10)*tau3^2 + 6*k5(11)*tau3 + 2*k5(12);
        ddq(6,i) = 12*k6(10)*tau3^2 + 6*k6(11)*tau3 + 2*k6(12);    
    end
    i = i + 1;
end

xi = zeros(6,inc);
for i=1:inc
    xi(:,i) = fk(q(:,i)');
end

figure
plot3(xi(1,:), xi(2,:), xi(3,:), 'Color','blue','Linewidth',3)
hold on
grid
plot3(xi1(1), xi1(2), xi1(3), 'Color','red','Linewidth', 3, 'Marker', 'o')
plot3(xi2(1), xi2(2), xi2(3), 'Color','red','Linewidth', 3, 'Marker', 'o')
plot3(xi3(1), xi3(2), xi3(3), 'Color','red','Linewidth', 3, 'Marker', 'o')
plot3(xi4(1), xi4(2), xi4(3), 'Color','red','Linewidth', 3, 'Marker', 'o')
